JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_xspi.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_XSPI_H_
#define FSL_XSPI_H_

#include "fsl_common.h"

/*!
 * @addtogroup xspi
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
#define FSL_XSPI_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@{*/

/*! @brief Formula to form XSPI instructions in LUT table. */
#define XSPI_LUT_SEQ(cmd0, pad0, op0, cmd1, pad1, op1)                                                              \
    (XSPI_LUT_INSTR0(cmd0) | XSPI_LUT_PAD0(pad0) | XSPI_LUT_OPRND0(op0) | XSPI_LUT_INSTR1(cmd1) | \
     XSPI_LUT_PAD1(pad1) | XSPI_LUT_OPRND1(op1))

/*! @brief Status structure of XSPI.*/
enum
{
    kStatus_XSPI_Busy                     = MAKE_STATUS(kStatusGroup_XSPI, 0), /*!< XSPI is Busy */
    kStatus_XSPI_IpCommandUsageError      = MAKE_STATUS(kStatusGroup_XSPI, 1), /*!< XSPI Ip Command Usage Error*/
    kStatus_XSPI_IpCommandtriggerError    = MAKE_STATUS(kStatusGroup_XSPI, 2), /*!< XSPI Ip Command Trigger Error*/
    kStatus_XSPI_IllegalInstructionError  = MAKE_STATUS(kStatusGroup_XSPI, 3), /*!< XSPI Illegal Instruction Error*/
    kStatus_XSPI_SequenceExecutionTimeout = MAKE_STATUS(kStatusGroup_XSPI, 4), /*!< XSPI Sequence Execution Timeout*/
    kStatus_XSPI_FradCheckError           = MAKE_STATUS(kStatusGroup_XSPI, 5), /*!< XSPI Frad Check Error*/
    kStatus_XSPI_TgQueueWritingError      = MAKE_STATUS(kStatusGroup_XSPI, 6), /*!< XSPI Tg Queue Writing Error*/
    kStatus_XSPI_IpsBusTransError         = MAKE_STATUS(kStatusGroup_XSPI, 7), /*!< XSPI Ip Bus Transfer Error*/
};

/*! @brief CMD definition of XSPI, use to form LUT instruction, _xspi_command. */
enum
{
    kXSPI_Command_STOP              = 0x00U, /*!< Stop execution, deassert CS. */
    kXSPI_Command_SDR               = 0x01U, /*!< Transmit Command code to Flash, using SDR mode. */
    kXSPI_Command_RADDR_SDR         = 0x02U, /*!< Transmit Row Address to Flash, using SDR mode. */
    kXSPI_Command_DUMMY_SDR         = 0x03U, /*!< Leave data lines undriven by xSPI controller, using SDR mode. */
    kXSPI_Command_MODE_SDR          = 0x04U, /*!< Transmit 8-bit Mode bits to Flash, using SDR mode. */
    kXSPI_Command_MODE2_SDR         = 0x05U, /*!< Transmit 2-bit Mode bits to Flash, using SDR mode. */
    kXSPI_Command_MODE4_SDR         = 0x06U, /*!< Transmit 4-bit Mode bits to Flash, using SDR mode. */
    kXSPI_Command_READ_SDR          = 0x07U, /*!< Receive Read Data from Flash, using SDR mode. */
    kXSPI_Command_WRITE_SDR         = 0x08U, /*!< Transmit Programming Data to Flash, using SDR mode. */
    kXSPI_Command_JMP_ON_CS         = 0x09U, /*!< Stop execution, deassert CS and save operand[7:0] as the
                                               instruction start pointer for next sequence*/
    kXSPI_Command_RADDR_DDR         = 0x0AU, /*!< Transmit Row Address to Flash, using DDR mode. */
    kXSPI_Command_MODE_DDR          = 0x0BU, /*!< Transmit 8-bit Mode bits to Flash, using DDR mode. */
    kXSPI_Command_MODE2_DDR         = 0x0CU, /*!< Transmit 2-bit Mode bits to Flash, using DDR mode. */
    kXSPI_Command_MODE4_DDR         = 0x0DU, /*!< Transmit 4-bit Mode bits to Flash, using DDR mode. */
    kXSPI_Command_READ_DDR          = 0x0EU, /*!< Receive Read Data from Flash, using DDR mode. */
    kXSPI_Command_WRITE_DDR         = 0x0FU, /*!< Transmit Programming Data to Flash, using DDR mode. */
    kXSPI_Command_LEARN_DDR         = 0x10U, /*!< Receive Read Data or Preamble bit from Flash, DDR mode. */
    kXSPI_Command_DDR               = 0x11U, /*!< Transmit Command code to Flash, using DDR mode. */
    kXSPI_Command_CADDR_SDR         = 0x12U, /*!< Transmit Column Address to Flash, using SDR mode. */
    kXSPI_Command_CADDR_DDR         = 0x13U, /*!< Transmit Column Address to Flash, using DDR mode. */
    kXSPI_Command_JUMP_TO_SEQ       = 0x14U,
};

/*! @brief pad definition of XSPI, use to form LUT instruction. */
typedef enum _xspi_pad
{
    kXSPI_1PAD = 0x00U, /*!< Transmit command/address and transmit/receive data only through DATA0/DATA1. */
    kXSPI_2PAD = 0x01U, /*!< Transmit command/address and transmit/receive data only through DATA[1:0]. */
    kXSPI_4PAD = 0x02U, /*!< Transmit command/address and transmit/receive data only through DATA[3:0]. */
    kXSPI_8PAD = 0x03U, /*!< Transmit command/address and transmit/receive data only through DATA[7:0]. */
} xspi_pad_t;

/*! @brief XSPI interrupt status flags.*/
typedef enum _xspi_flags
{
    kXSPI_DataLearningFailedFlag = XSPI_FR_DLPFF_MASK, /*!< Data learning failed. */
    kXSPI_DllAbortFlag = XSPI_FR_DLLABRT_MASK,         /*!< DLL Abort. */
    kXSPI_DllUnlockFlag = XSPI_FR_DLLUNLCK_MASK,       /*!< This field is set whenever DLL unlock event occurs,
                                                         irrespective of flash memory access.*/
    kXSPI_TxBufferFillFlag = XSPI_FR_TBFF_MASK,        /*!< If the field remains cleared,
                                                         the TX buffer can be considered as full.*/
    kXSPI_TxBufferUnderrunFlag = XSPI_FR_TBUF_MASK,    /*!< This field is set if the module tries to pull data
                                                         when the TX buffer is empty*/
    kXSPI_RxBufferOverflowFlag = XSPI_FR_RBOF_MASK,    /*!< This field is set when no more data can be pushed
                                                         into the RX buffer from the serial flash memory device.*/
    kXSPI_RxBufferDrainFlag = XSPI_FR_RBDF_MASK,       /*!< This field is set if SR[RXWE] is asserted.*/
    kXSPI_AhbAbortErrorFlag = XSPI_FR_AAEF_MASK,       /*!< This flag can be set when AHB transaction error*/
    kXSPI_AhbIllegalTransactionErrorFlag = XSPI_FR_AITEF_MASK,
    kXSPI_AhbIllegalBurstSizeErrorFlag = XSPI_FR_AIBSEF_MASK,
    kXSPI_AhbBufferOverflowFlag = XSPI_FR_ABOF_MASK,
    kXSPI_AhbPerformanceMonitorOverflowFlag = XSPI_FR_PERFOVF_MASK,
    kXSPI_AhbReadAddressErrorFlag = XSPI_FR_RDADDR_MASK,
    kXSPI_IllegalInstructionErrorFlag = XSPI_FR_ILLINE_MASK, /*!< This field is set when an illegal instruction is
                                                               encountered by the controller in any of the sequences.*/
    kXSPI_IpCmdtriggerErrorFlag = XSPI_FR_IPIEF_MASK,
    kXSPI_PageProgramWaitFlag = XSPI_FR_PPWF_MASK,
    kXSPI_IPEDRxDecryptionErrorFlag = XSPI_FR_IPEDERR_MASK, /*!< only support XSPI0 XSPI1*/
    kXSPI_IpCommandExecutionDoneFlag = XSPI_FR_TFF_MASK,
    kXSPI_SequenceExecutionTimeoutFlag = XSPI_INT_EN_TO_ERR_MASK, /*!< Sequence execution timeout. */
    kXSPI_FradMatchErrorFlag = XSPI_INT_EN_FRADMTCH_MASK,   /*Transaction address does not lie within address range of
                                                              any FRAD descriptor.*/
    kXSPI_FradnAccErrorFlag = XSPI_INT_EN_FRAD0ACC_MASK | XSPI_INT_EN_FRAD1ACC_MASK | XSPI_INT_EN_FRAD2ACC_MASK |
                              XSPI_INT_EN_FRAD3ACC_MASK | XSPI_INT_EN_FRAD4ACC_MASK | XSPI_INT_EN_FRAD5ACC_MASK |
                              XSPI_INT_EN_FRAD6ACC_MASK | XSPI_INT_EN_FRAD7ACC_MASK,
    kXSPI_IpsErrorFlag = XSPI_INT_EN_IPS_ERR_MASK,
    kXSPI_Tg0SfarErrorFlag = XSPI_INT_EN_TG0SFAR_MASK, 
    kXSPI_Tg1SfarErrorFlag = XSPI_INT_EN_TG1SFAR_MASK,
    kXSPI_TgnIpcrErrorFlag = XSPI_INT_EN_TG0IPCR_MASK | XSPI_INT_EN_TG1IPCR_MASK,
    kXSPI_LockRegErrorFlag = XSPI_INT_EN_LCK_ERR_IE_MASK,
    kXSPI_ArbLockTimeoutFlag = XSPI_INT_EN_ARB_TO_IE_MASK,
    kXSPI_ArbWinEventFlag = XSPI_INT_EN_ARB_WIN_IE_MASK,
} xspi_flags_t;

/*! @brief Specifies which clock to use for data alignment. */
typedef enum _xspi_sample_time_reference
{
    kXSPI_InternalReferenceClock = 0x0U,  /*!< Data aligned with the posedge of internal reference clock of XSPI*/
    kXSPI_2xFlashHalfClock = 0x1U,        /*!< Data aligned with 2x serial flash memory half clock*/
} xspi_sample_time_reference_t;

/*! @brief Target group. */
typedef enum _xspi_target_group
{
    kXSPI_TargetGroup0 = 0x0U,          /*!< Target groupe queue 0*/
    kXSPI_TargetGroup1 = 0x1U,          /*!< Target groupe queue 1*/
} xspi_target_group_t;

/*! @brief sample delay with reference edge*/
typedef enum _xspi_delay_with_reference_edge
{
    kXSPI_SameWithDqs = 0x0U,          /*!< The same with DQS*/
    kXSPI_HalfCycleEarlyDqs = 0x1U,    /*!< Half cycle early with DQS*/
} xspi_delay_with_reference_edge_t;

/*! @brief XSPI defines the secure attribute selection criteria for entry into descriptor queue...*/
typedef enum _xspi_secure_attribute
{
    kXSPI_AttributeMasterNonsecureOnly        = 0x1U, /*!< Allow the bus attribute for this master to
                                                           non-secure only*/
    kXSPI_AttributeMasterSecureOnly           = 0x2U, /*!< Allow the bus attribute for this master to secure only*/
    kXSPI_AttributeMasterNonsecureSecureBoth  = 0x3U, /*!< Allow the bus master's attribute: Both secure and
                                                           non-secure*/
} xspi_secure_attribute_t;

/*! @brief Descriptor lock. */
typedef enum _xspi_descriptor_lock
{
    kXSPI_DescriptorLockDisabled               = 0x0U, /*!< Descriptor registers can be written by any master*/
    kXSPI_DescriptorLockEnabledTillHardReset   = 0x1U, /*!< FRAD descriptor is read-only till next hard reset.*/
    kXSPI_DescriptorLockEnabledExceptMasterId  = 0x2U, /*!< Descriptors are read-only. MDnACP fields can be programmed only
                                                         by the master with ID matching the MID.*/
    kXSPI_DescriptorLockEnabled                = 0x3U, /*!< Descriptor registers are read-only.*/
} xspi_descriptor_lock_t;

/*! @brief Exclusive access lock. */
typedef enum _xspi_exclusive_access_lock
{
    kXSPI_ExclusiveAccessLockDisabled          = 0x0U, /*!< Write permissions available for all masters
                                                         based on their MDxACP evaluation.*/
    kXSPI_ExclusiveAccessLockEnabled           = 0x2U, /*!< Write permissions revoked for all domains. Any write
                                                       transaction coming to this flash address will result in an error..*/
    kXSPI_ExclusiveAccessLockExceptMasterId    = 0x3U, /*!< Write permissions are revoked for all masters except the master ID specified by FRADn_WORD2[EALO] fields.*/
} xspi_exclusive_access_lock_t;

/*! @brief XSPI AHB access towards flash is broken if this AHB alignment boundary is crossed.
 This field is only supported XSPI0 XSPI1.*/
typedef enum _xspi_ahb_alignment
{
    kXSPI_AhbAlignmentNoLimit   = 0x0U,            /*!< no limit*/
    kXSPI_AhbAlignment256BLimit = 0x1U,            /*!< 256B limit*/
    kXSPI_AhbAlignment512BLimit = 0x2U,            /*!< 512B limit*/
    kXSPI_AhbAlignment1KBLimit  = 0x3U,            /*!< 1KB limit*/
} xspi_ahb_alignment_t;

/*! @brief XSPI AHB Split Size These bits are used to control the split size when split function is enabled BFGENCR[SPLITEN] is '1'.*/
typedef enum _xspi_ahb_split_size
{
    kXSPI_AhbSplitSize8b  = 0x0U,                 /*!< split size is 8 bytes*/
    kXSPI_AhbSplitSize16b = 0x1U,                 /*!< split size is 16 bytes*/
    kXSPI_AhbSplitSize32b = 0x2U,                 /*!< split size is 32 bytes*/
    kXSPI_AhbSplitSize64b = 0x3U,                 /*!< split size is 64 bytes*/
} xspi_ahb_split_size_t;

