JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_xspi.h
/*! @brief Byte ordering endianness. */
typedef enum _xspi_byte_order
{
    kXSPI_64BitBE  =  0x0U,                      /*!< 64 bit big endian*/
    kXSPI_32BitLE  =  0x1U,                      /*!< 32 bit little endian*/
    kXSPI_32BitBE  =  0x2U,                      /*!< 32 bit big endian*/
    kXSPI_64BitLE  =  0x3U,                      /*!< 64 bit little endian*/
} xspi_byte_order_t;

/*! @brief Subbuffer division factor. */
typedef enum _xspi_subbuffer_division_factor
{
    kXSPI_Division0  = 0x0U,                     /*!< division factor 0*/
    kXSPI_Division2  = 0x1U,                     /*!< division factor 2 subbuffer size/2*/
    kXSPI_Division4  = 0x2U,                     /*!< division factor 4 subbuffer size/4*/
    kXSPI_Division8  = 0x3U,                     /*!< division factor 8 subbuffer size/8*/
    kXSPI_Division16 = 0x4U,                     /*!< division factor 16 subbuffer size/16*/
} xspi_subbuffer_division_factor_t;

/*! @brief XSPI sample clock source selection for Flash Reading.*/
typedef enum _xspi_read_sample_clock
{
    kXSPI_ReadSampleClkLoopbackFromDqsPad = 0x2U,      /*!< Dummy Read strobe generated by FlexSPI Controller
                                                               and loopback from DQS pad. */
    kXSPI_ReadSampleClkExternalInputFromDqsPad = 0x3U, /*!< Flash provided Read strobe and input from DQS pad. */
} xspi_read_sample_clock_t;

/*! @brief Command type. */
typedef enum _xspi_command_type
{
    kXSPI_Command, /*!< XSPI operation: Only command, both TX and Rx buffer are ignored. */
    kXSPI_Config,  /*!< XSPI operation: Configure device mode, the TX fifo size is fixed in LUT. */
    kXSPI_Read,    /*!< XSPI operation: Read, only Rx Buffer is effective. */
    kXSPI_Write,   /*!< XSPI operation: Read, only Tx Buffer is effective. */
} xspi_command_type_t;

/*! @brief Dll Mode. */
typedef enum _xspi_dll_mode
{
    kXSPI_AutoUpdateMode,    /*!< Dll mode : Auto update mode. */
    kXSPI_BypassMode,        /*!< Dll mode : Bypass mode. */
} xspi_dll_mode_t;

/*! @brief MDAD configuration. */
typedef struct _xspi_mdad_config_t
{
    bool assignIsValid;                      /*!< Indicates whether MDAD Descriptor for the target groupn is valid*/
    bool enableDescriptorLock;               /*!< This field provides a means to make the MDAD descriptor read-only.
                                               Once written '1' this field will remain '1' until hard reset*/
    uint8_t maskType;                        /*!< 0b - ANDed mask 1b - ORed mask*/
    uint8_t mask;                            /*!< Defines the 6-bit mask value for the ID-Match comparison*/
    uint8_t masterIdReference;               /*!< Specifies the reference value of the Master-ID for MID-comparison*/
    xspi_secure_attribute_t secureAttribute;   /*!< Defines the secure attribute selection criteria for entry into
                                               descriptor queue*/
} xspi_mdad_config_t;

/*! @brief FRAD configuration. */
typedef struct _xspi_frad_config_t
{
    uint32_t startAddress;        /*!< Specifies the specific flash memory region starting address*/
    uint32_t endAddress;          /*!< Specifies the specific flash memory region end address*/
    uint8_t excAccLockOwer;       /*!< When FRADn_WORD3[EAL] = 11, this field indicates the Master ID that owns the
                                    exclusive access lock*/
    uint8_t tg0MasterAccess;      /*!< This field define the access restrictions for respective Master Domain
                                    corresponding to this FRAD region. Access permissions are decided  based on secure
                                    an privilege attributes of current transaction. Read access is not restricted.*/
    uint8_t tg1MasterAccess;
    bool assignIsValid;           /*!< This field indicates whether the FRAD Descriptor for a specific flash region
                                    is valid.*/
    xspi_descriptor_lock_t  descriptorLock;            /*!< This field enables masking of accidental write on FRAD registers.
                                                       Lock is enabled/disabled by Secure/ Privileged master.*/
    xspi_exclusive_access_lock_t exclusiveAccessLock;  /*!< This field provides exclusive write lock over a
                                                       FRAD region based on MDnACP.*/
} xspi_frad_config_t;

/*! @brief ahb buffer configuration. */
typedef struct _xspi_ahbBuffer_config
{
    uint8_t masterIndex;          /*!< AHB Master ID the AHB RX Buffer is assigned. */
    uint16_t transferSize;        /*!< AHB transfer size in byte. */
    uint16_t topIndex;            /*!< AHB Buffer specifies the top index for buffer 0, which defines its size.*/
    union
    {
        bool enablePriority;      /*!< High Priority Enable, it can be written '1' only when OTFAD is disabled. */
        bool enableAllMaster;     /*!< When set, buffer3 acts as an all-master buffer.buff[i] routed to buffer3*/
    } enaPri;
    bool enableSubdivision;       /*!< AHB Buffer Sub-division Enable */
	xspi_subbuffer_division_factor_t  subBuffer[3];   /*!< subBuffer division factor*/
} xspi_ahbBuffer_config_t;

/*! @brief XSPI configuration structure. */
typedef struct _xspi_config
{
    xspi_read_sample_clock_t rxSampleClock;  /*!< Sample Clock source selection for Flash Reading.*/
    xspi_byte_order_t byteOrder;             /*!< Byte ordering endianness*/
    bool enableCknPad;                       /*!< Enable/disable clock on differential CKN pad for flash memory A.*/
    bool enableDoze;                         /*!< Enable/disable doze mode support. */
    bool enableDqs;                          /*!< Enable/disable DQS*/
    bool enableDqsLatency;                   /*!< Enable/disable DQS latency*/
    bool enableDataLearn;                    /*!< Enable/disable Data Learning*/
    bool enableDqsOut;                       /*!< Enable/disable DQS Out only for HyperRAM*/
    bool enableVariableLat;                  /*!< Enable/disable variable latency feature only for HyperRAM*/

    bool enableGloAccCtr;                    /*!< Enable/disable Global access ctrol*/
    struct
    {
        xspi_mdad_config_t tgmdad[2];
        bool enableMdad;                     /*!< Enable/disable first MDAD check*/
    } mdadConfig;
    struct
    {
        xspi_frad_config_t frad[8];    
        bool enableFrad;                     /*!< Enable/disable second FRAD check only for write commond*/
    } fradConfig;
    uint8_t txWatermark;                     /*!< XSPI IP transmit watermark value. */
    uint8_t rxWatermark;                     /*!< XSPI receive watermark value. */
    struct
    {
        xspi_ahbBuffer_config_t buffer[4];   /*!< AHB buffer size. */

        bool enableAHBPrefetch;              /*!< Enable/disable AHB read prefetch feature, when enabled, XSPI
                                               will fetch more data than current AHB burst. */
        bool enableAHBSlite;                 /*!< When this bit is set to 1, all AHB read/write burst will be spliT
                                               into small transactions at Flash SPI bus side.*/
        bool enableAHBWaitWrite;             /*!< <enable> After the first write transaction
                                               next AHB write transfer is kept waiting by keeping AHB HREADY low.*/
        bool enableAHBWaitRead;              /*!< <disable> subsequent reads  <enable> After the first write
                                               transaction, next AHB read transfer (in case of buffer miss)
                                               is kept waiting by keeping AHB HREADY low.*/
        xspi_ahb_split_size_t ahbSplitSize;  /*!< the split size when split function is enabled BFGENCR[SPLITEN]
                                               is '1'.*/
        xspi_ahb_alignment_t   ahbAlignment; /*!< AHB access towards flash is broken if this AHB alignment boundary
                                               is crossed, only support XSPI0 XSPI1*/
    } ahbConfig;
} xspi_config_t;

/*! @brief External device configuration items. */
typedef struct _xspi_device_config
{
    bool enableX16Mode;                         /*!< Enable X16 Mode Only for default 16 I/O bus PSRAM. */
    bool enableWriteFlush;                      /*!< Enable write flush. */
    bool enableDdr;                             /*!< Enable DDR mode. */
    uint32_t xspiRootClk;                       /*!< XSPI serial root clock. */
    uint32_t flashA1Size;                       /*!< Flash A1 size in KByte. */
    uint32_t flashA2Size;                       /*!< Flash A2 size in KByte. */
    uint8_t CSHoldTime;                         /*!< CS line hold time. */
    uint8_t CSSetupTime;                        /*!< CS line setup time. */
    xspi_sample_time_reference_t sampleTimeRef; /*data aligned clock in hold time only support DDR mode*/
    uint8_t columnSpace;                        /*!< Column space size. */
    uint8_t PageProgramBoundary;                /*!< page program boundary size should be programmed in Log2 (size in
                                                     bytes) format. The default is 8 for 256-byte page program size.*/
    bool enableWordAddress;                     /*!< If enable word address.*/
    bool enable4BWordAddress;                   /*!< If enable 4B word address.*/
    uint8_t AWRSeqIndex;                        /*!< Sequence ID for AHB write command. */
    uint8_t ARDSeqIndex;                        /*!< Sequence ID for AHB read command. */
    uint8_t ARDSRSeqIndex;                      /*!< Sequence ID for AHB reading the status register from
                                                     flash in case of page program wait period.*/
    struct
    {
        xspi_dll_mode_t dllMode;              /*!< Dll mode auto update mode or bypass mode */
        bool enableCdl8;                      /*!< Enable CDL8. */
        uint8_t dllReferenceCounter;          /*!< DLL reference counter. */
        uint8_t dllResolution;                /*!< DLL resolution. */
        uint8_t slaveFineOffset;              /*!< Fine offset delay elements in incoming DQS*/
        uint8_t slaveDelayOffset;             /*!< T/16 offset delay elements in incoming DQS*/
        uint8_t slaveDelayCoarse;             /*!< Delay elements in each delay tap The field is used to over DLL
                                                values and works when the value of SLV_DLL_BYPASS is 1.*/
    } dllConfig;

    struct
    {
        uint8_t tapNumber;                              /*!< Selects the n tap provided by slave delay chain
                                                             for flash memory A*/
        xspi_delay_with_reference_edge_t delayWithRef;  /*!< This field selects the delay in accordance with the
                                                             reference edge for the valid sample point.*/
        bool enableAtInvertedClock;                     /*!< This field selects the edge of the sampling clock for
                                                             full-speed commands.*/
    } smprConfig;
} xspi_device_config_t;

/*! @brief Transfer structure for XSPI. */
typedef struct _xspi_transfer
{
    uint32_t deviceAddress;         /*!< Operation device address. */
    xspi_command_type_t cmdType;    /*!< Execution command type. */
    uint8_t seqIndex;               /*!< Sequence ID for command. */
    uint32_t *data;                 /*!< Data buffer. */
    size_t dataSize;                /*!< Data size in bytes. */
    xspi_target_group_t targetGroup;  /*!< Target group. include targetGroup[0] targetGroup[1]*/
} xspi_transfer_t;

