JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_xspi.h
/* Forward declaration of the handle typedef. */
typedef struct _xspi_handle xspi_handle_t;

/*! @brief XSPI transfer callback function. */
typedef void (*xspi_transfer_callback_t)(XSPI_Type *base,
                                            xspi_handle_t *handle,
                                            status_t status,
                                            void *userData);

/*! @brief Transfer handle structure for XSPI. */
struct _xspi_handle
{
    uint32_t state;                                 /*!< Internal state for XSPI transfer */
    uint8_t *data;                                  /*!< Data buffer. */
    size_t dataSize;                                /*!< Remaining Data size in bytes. */
    size_t transferTotalSize;                       /*!< Total Data size in bytes. */
    xspi_transfer_callback_t completionCallback;    /*!< Callback for users while transfer finish or error occurred */
    void *userData;                                 /*!< XSPI callback function parameter.*/
};

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /*_cplusplus. */

/*!
 * @name Initialization and deinitialization
 * @{
 */

/*!
 * @brief Get the instance number for XSPI.
 *
 * @param base XSPI base pointer.
 */
uint32_t XSPI_GetInstance(XSPI_Type *base);

/*!
 * @brief Check and clear IP command execution errors.
 *
 * @param base XSPI base pointer.
 * @param status interrupt status.
 */
status_t XSPI_CheckAndClearError(XSPI_Type *base, uint32_t status);

/*!
 * @brief Initializes the XSPI module and internal state.
 *
 * This function configures the XSPI with the
 * input configure parameters. Users should call this function before any XSPI operations.
 *
 * @param base XSPI peripheral base address.
 * @param config XSPI configure structure.
 */
void XSPI_Init(XSPI_Type *base, const xspi_config_t *config);

/*!
 * @brief Gets default settings for XSPI.
 * @param base XSPI peripheral base address.
 * @param config XSPI configuration structure.
 */
void XSPI_GetDefaultConfig(XSPI_Type *base, xspi_config_t *config, xspi_device_config_t *devconfig);

/*!
 * @brief Deinitializes the XSPI module.
 *
 * Clears the XSPI state and  XSPI module registers.
 * @param base XSPI peripheral base address.
 * @param devconfig Flash configuration parameters.
 */
void XSPI_Deinit(XSPI_Type *base);

/*!
 * @brief Configures the connected device parameter.
 *
 * This function configures the connected device relevant parameters, such as the size, command, and so on.
 * The flash configuration value cannot have a default value. The user needs to configure it according to the
 * connected device.
 *
 * @param base XSPI peripheral base address.
 * @param devconfig Flash configuration parameters.
 */
void XSPI_SetFlashConfig(XSPI_Type *base, xspi_device_config_t *devconfig);

/*!
 * @brief Software reset for the XSPI AND AHB.
 *
 * This function sets the software reset flags for both AHB and buffer domain and
 * resets both AHB buffer and also IP FIFOs.
 *
 * @param base XSPI peripheral base address.
 */
static inline void XSPI_SoftwareReset(XSPI_Type *base)
{
    base->MCR |= XSPI_MCR_SWRSTSD_MASK | XSPI_MCR_SWRSTHD_MASK;
    for(uint32_t i = 0;i < 6;i++)
    {
        __NOP();
    }
    base->MCR &= ~(XSPI_MCR_SWRSTSD_MASK | XSPI_MCR_SWRSTHD_MASK);
    base->MCR |= XSPI_MCR_IPS_TG_RST_MASK | XSPI_MCR_MDIS_MASK;
    base->MCR &= ~XSPI_MCR_ISD3FA_MASK;
    base->MCR &= ~XSPI_MCR_MDIS_MASK;
    base->MCR |= XSPI_MCR_MDIS_MASK;
    base->MCR |= XSPI_MCR_ISD3FA_MASK;
    base->MCR &= ~ XSPI_MCR_MDIS_MASK;
}

/*!
 * @brief Enables XSPI X16 mode. Only support XSPI1 and XSPI2.
 *
 * @param base XSPI peripheral base address.
 */
static inline void XSPI_EnableX16Mode(XSPI_Type *base)
{
    base->MCR |= XSPI_MCR_MDIS_MASK;
    base->MCR |= XSPI_MCR_X16_EN_MASK;
    base->MCR &= ~XSPI_MCR_MDIS_MASK;
}

/*!
 * @brief Enables or disables the XSPI module.
 *
 * @param base XSPI peripheral base address.
 * @param enable True means enable XSPI, false means disable.
 */
static inline void XSPI_Enable(XSPI_Type *base, bool enable)
{
    if (enable)
    {
        base->MCR &= ~XSPI_MCR_MDIS_MASK;
    }
    else
    {
        base->MCR |= XSPI_MCR_MDIS_MASK;
    }
}

/* @} */

/*!
 * @name Interrupts
 * @{
 */
/*!
 * @brief Enables the XSPI interrupts.
 *
 * @param base XSPI peripheral base address.
 * @param mask XSPI interrupt source.
 */

static inline void XSPI_EnableInterrupts(XSPI_Type *base, uint32_t mask)
{
    base->RSER |= mask;
}

/*!
 * @brief Disable the XSPI interrupts.
 *
 * @param base XSPI peripheral base address.
 * @param mask XSPI interrupt source.
 */
static inline void XSPI_DisableInterrupts(XSPI_Type *base, uint32_t mask)
{
    base->RSER &= ~mask;
}

/* @} */

/*! @name DMA control */
/*@{*/

/*!
 * @brief Enables or disables XSPI IP Tx FIFO DMA requests.
 *
 * @param base XSPI peripheral base address.
 * @param enable Enable flag for transmit DMA request. Pass true for enable, false for disable.
 */
static inline void XSPI_EnableTxDMA(XSPI_Type *base, bool enable)
{
    if (enable)
    {
        base->RSER |= XSPI_RSER_TBFDE_MASK;
    }
    else
    {
        base->RSER &= ~XSPI_RSER_TBFDE_MASK;
    }
}

/*!
 * @brief Enables or disables XSPI IP Rx FIFO DMA requests.
 *
 * @param base XSPI peripheral base address.
 * @param enable Enable flag for receive DMA request. Pass true for enable, false for disable.
 */
static inline void XSPI_EnableRxDMA(XSPI_Type *base, bool enable)
{
    if (enable)
    {
        base->RSER |= XSPI_RSER_RBDDE_MASK;
    }
    else
    {
        base->RSER &= ~XSPI_RSER_RBDDE_MASK;
    }
}

/*!
 * @brief Gets XSPI IP tx fifo address for DMA transfer.
 *
 * @param base XSPI peripheral base address.
 * @retval The tx fifo address.
 */
static inline uint32_t XSPI_GetTxFifoAddress(XSPI_Type *base)
{
    return (uint32_t)&base->TBDR;
}

/*!
 * @brief Gets XSPI IP rx fifo address for DMA transfer.
 *
 * @param base XSPI peripheral base address.
 * @retval The rx fifo address.
 */
static inline uint32_t XSPI_GetRxFifoAddress(XSPI_Type *base)
{
    return (uint32_t)&base->RBDR[0];
}

/*@}*/

/*! @name FIFO control */
/*@{*/

/*! @brief Clears the XSPI IP FIFO logic.
 *
 * @param base XSPI peripheral base address.
 * @param txFifo Pass true to reset TX FIFO.
 * @param rxFifo Pass true to reset RX FIFO.
 */
static inline void XSPI_ResetFifos(XSPI_Type *base, bool txFifo, bool rxFifo)
{
    if (txFifo)
    {
        base->MCR |= XSPI_MCR_CLR_TXF_MASK;
    }
    if (rxFifo)
    {
        base->MCR |= XSPI_MCR_CLR_RXF_MASK;
    }
}
/*@}*/

/*!
 * @name Status
 * @{
 */
/*!
 * @brief Get the XSPI interrupt status flags.
 *
 * @param base XSPI peripheral base address.
 * @retval interrupt status flag, use status flag to AND #xspi_flags_t could get the related status.
 */
static inline uint32_t XSPI_GetInterruptStatusFlags(XSPI_Type *base)
{
    return base->ERRSTAT;
}

/*! @brief Returns whether the bus is idle.
 *
 * @param base XSPI peripheral base address.
 * @retval true Bus is idle.
 * @retval false Bus is busy.
 */
static inline bool XSPI_GetBusIdleStatus(XSPI_Type *base)
{
    return (1U != (base->SR & XSPI_SR_BUSY_MASK));
}
/*@}*/

/*!
 * @name Bus Operations
 * @{
 */

/*! @brief Update read sample clock source
 *
 * @param base XSPI peripheral base address.
 * @param clockSource clockSource of type #flexspi_read_sample_clock_t
 */
void XSPI_UpdateRxSampleClock(XSPI_Type *base, xspi_read_sample_clock_t clockSource);

